Autodesk.Revit.DB.ViewDisplayModel.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ViewDisplayModel.SmoothEdges
True to enable "smooth edge" (anti-aliasing) effect. False to disable it.
Since:
2015

Autodesk.Revit.DB.ViewDisplayModel.ShowHiddenLines
True to enable hidden lines. False to disable showing them.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.ViewDisplayModel.SilhouetteEdgesGStyleId
Style ID for silhouette edges
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ViewDisplayModel.EnableSilhouettes
True to show silhouettes edges. False to disable showing them.
Since:
2015

Autodesk.Revit.DB.ViewDisplayModel.Transparency
The percentage (0..100) of surface transparency
0 means the surfaces are opaque, 100 means they are fully transparent
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value is invalid. The valid range is 0 through 100
Since:
2015

Autodesk.Revit.DB.ViewDisplayModel
Represents the settings for displaying model graphics.
version 2: m_showHiddenLines type changed bool -> ShowHiddenLinesValues::Enum
Since:
2015